; domain
(define (domain pipes)
	(:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions)


	(:predicates 
		(nextTo ?wpA ?wpB)
		(hasPicture ?auv ?wp)
		(robotAt ?auv ?wp)
		(KBquery_inspectionNeeded ?wp)
		(KBquery_inspected ?wp)
	)

	(:action Move
	  :parameters (?auv ?wpA ?wpB)
	  :precondition (and    
	    (or (nextTo ?wpA ?wpB) (nextTo ?wpB ?wpA))
		(robotAt ?auv ?wpA)
	  )
	  :effect (and
	    (not (robotAt ?auv ?wpA))
		(robotAt ?auv ?wpB)
	  )
	)

	(:action takePicture 
	  :parameters (?auv ?wp)
	  :precondition (and 
		(robotAt ?auv ?wp)
	  )
	  :effect (and 
		(hasPicture ?auv ?wp)
	  )
	)
)

; problem
(define (problem pipes_problem)
	(:domain pipes)
	(:objects aa ab ac ad ae af ag ba bb bc bd be bf bg ca cb cc cd ce cf cg da db dc dd de df dg ea eb ec ed ee ef eg fa fb fc fd fe ff fg ga gb gc gd ge gf gg auv )
	(:init
		(nextTo aa ab)
		(nextTo aa ba)
		(nextTo ab ac)
		(nextTo ba ca)
		(nextTo ac ad)
		(nextTo ca da)
		(nextTo ad ae)
		(nextTo da ea)
		(nextTo ae af)
		(nextTo ea fa)
		(nextTo af ag)
		(nextTo fa ga)
		(nextTo ba bb)
		(nextTo ab bb)
		(nextTo bb bc)
		(nextTo bb cb)
		(nextTo bc bd)
		(nextTo cb db)
		(nextTo bd be)
		(nextTo db eb)
		(nextTo be bf)
		(nextTo eb fb)
		(nextTo bf bg)
		(nextTo fb gb)
		(nextTo ca cb)
		(nextTo ac bc)
		(nextTo cb cc)
		(nextTo bc cc)
		(nextTo cc cd)
		(nextTo cc dc)
		(nextTo cd ce)
		(nextTo dc ec)
		(nextTo ce cf)
		(nextTo ec fc)
		(nextTo cf cg)
		(nextTo fc gc)
		(nextTo da db)
		(nextTo ad bd)
		(nextTo db dc)
		(nextTo bd cd)
		(nextTo dc dd)
		(nextTo cd dd)
		(nextTo dd de)
		(nextTo dd ed)
		(nextTo de df)
		(nextTo ed fd)
		(nextTo df dg)
		(nextTo fd gd)
		(nextTo ea eb)
		(nextTo ae be)
		(nextTo eb ec)
		(nextTo be ce)
		(nextTo ec ed)
		(nextTo ce de)
		(nextTo ed ee)
		(nextTo de ee)
		(nextTo ee ef)
		(nextTo ee fe)
		(nextTo ef eg)
		(nextTo fe ge)
		(nextTo fa fb)
		(nextTo af bf)
		(nextTo fb fc)
		(nextTo bf cf)
		(nextTo fc fd)
		(nextTo cf df)
		(nextTo fd fe)
		(nextTo df ef)
		(nextTo fe ff)
		(nextTo ef ff)
		(nextTo ff fg)
		(nextTo ff gf)
		(nextTo ga gb)
		(nextTo ag bg)
		(nextTo gb gc)
		(nextTo bg cg)
		(nextTo gc gd)
		(nextTo cg dg)
		(nextTo gd ge)
		(nextTo dg eg)
		(nextTo ge gf)
		(nextTo eg fg)
		(nextTo gf gg)
		(nextTo fg gg)
		(nextTo aa bb)
		(nextTo ab bc)
		(nextTo ac bd)
		(nextTo ad be)
		(nextTo ae bf)
		(nextTo af bg)
		(nextTo ab ba)
		(nextTo ac bb)
		(nextTo ad bc)
		(nextTo ae bd)
		(nextTo af be)
		(nextTo ag bf)
		(nextTo ba cb)
		(nextTo bb cc)
		(nextTo bc cd)
		(nextTo bd ce)
		(nextTo be cf)
		(nextTo bf cg)
		(nextTo bb ca)
		(nextTo bc cb)
		(nextTo bd cc)
		(nextTo be cd)
		(nextTo bf ce)
		(nextTo bg cf)
		(nextTo ca db)
		(nextTo cb dc)
		(nextTo cc dd)
		(nextTo cd de)
		(nextTo ce df)
		(nextTo cf dg)
		(nextTo cb da)
		(nextTo cc db)
		(nextTo cd dc)
		(nextTo ce dd)
		(nextTo cf de)
		(nextTo cg df)
		(nextTo da eb)
		(nextTo db ec)
		(nextTo dc ed)
		(nextTo dd ee)
		(nextTo de ef)
		(nextTo df eg)
		(nextTo db ea)
		(nextTo dc eb)
		(nextTo dd ec)
		(nextTo de ed)
		(nextTo df ee)
		(nextTo dg ef)
		(nextTo ea fb)
		(nextTo eb fc)
		(nextTo ec fd)
		(nextTo ed fe)
		(nextTo ee ff)
		(nextTo ef fg)
		(nextTo eb fa)
		(nextTo ec fb)
		(nextTo ed fc)
		(nextTo ee fd)
		(nextTo ef fe)
		(nextTo eg ff)
		(nextTo fa gb)
		(nextTo fb gc)
		(nextTo fc gd)
		(nextTo fd ge)
		(nextTo fe gf)
		(nextTo ff gg)
		(nextTo fb ga)
		(nextTo fc gb)
		(nextTo fd gc)
		(nextTo fe gd)
		(nextTo ff ge)
		(nextTo fg gf)
		(robotAt auv aa)
	)
	(:goal (and
		(robotAt auv aa) 
		(forall (?wp) (or 
			(not (KBquery_inspectionNeeded ?wp))  
			(KBquery_inspected ?wp)
			)
		)
		)
	)
)

; plan
1. (move auv aa ba)
   deleted: (robotat auv aa)
   added: (robotat auv ba)
   goals met: 1 of 2
2. (move auv ba ca)
   deleted: (robotat auv ba)
   added: (robotat auv ca)
   goals met: 1 of 2
3. (move auv ca da)
   deleted: (robotat auv ca)
   added: (robotat auv da)
   goals met: 1 of 2
4. (move auv da ea)
   deleted: (robotat auv da)
   added: (robotat auv ea)
   goals met: 1 of 2
5. (move auv ea fb)
   deleted: (robotat auv ea)
   added: (robotat auv fb)
   goals met: 1 of 2
6. (move auv fb gc)
   deleted: (robotat auv fb)
   added: (robotat auv gc)
   goals met: 1 of 2
7. (takepicture auv gc)
   added: (haspicture auv gc)
   goals met: 1 of 2
8. (move auv gc fd)
   deleted: (robotat auv gc)
   added: (robotat auv fd)
   goals met: 1 of 2
9. (move auv fd ee)
   deleted: (robotat auv fd)
   added: (robotat auv ee)
   goals met: 1 of 2
10. (takepicture auv ee)
   added: (haspicture auv ee)
   goals met: 1 of 2
11. (move auv ee df)
   deleted: (robotat auv ee)
   added: (robotat auv df)
   goals met: 1 of 2
12. (move auv df cg)
   deleted: (robotat auv df)
   added: (robotat auv cg)
   goals met: 1 of 2
13. (takepicture auv cg)
   added: (haspicture auv cg)
   goals met: 1 of 2
14. (move auv cg bf)
   deleted: (robotat auv cg)
   added: (robotat auv bf)
   goals met: 1 of 2
15. (move auv bf ae)
   deleted: (robotat auv bf)
   added: (robotat auv ae)
   goals met: 1 of 2
16. (move auv ae bd)
   deleted: (robotat auv ae)
   added: (robotat auv bd)
   goals met: 1 of 2
17. (move auv bd cc)
   deleted: (robotat auv bd)
   added: (robotat auv cc)
   goals met: 1 of 2
18. (takepicture auv cc)
   added: (haspicture auv cc)
   goals met: 1 of 2
19. (move auv cc cd)
   deleted: (robotat auv cc)
   added: (robotat auv cd)
   goals met: 1 of 2
20. (move auv cd de)
   deleted: (robotat auv cd)
   added: (robotat auv de)
   goals met: 1 of 2
21. (move auv de ed)
   deleted: (robotat auv de)
   added: (robotat auv ed)
   goals met: 1 of 2
22. (move auv ed ec)
   deleted: (robotat auv ed)
   added: (robotat auv ec)
   goals met: 1 of 2
23. (move auv ec eb)
   deleted: (robotat auv ec)
   added: (robotat auv eb)
   goals met: 1 of 2
24. (move auv eb da)
   deleted: (robotat auv eb)
   added: (robotat auv da)
   goals met: 1 of 2
25. (move auv da ca)
   deleted: (robotat auv da)
   added: (robotat auv ca)
   goals met: 1 of 2
26. (move auv ca ba)
   deleted: (robotat auv ca)
   added: (robotat auv ba)
   goals met: 1 of 2
27. (move auv ba aa)
   deleted: (robotat auv ba)
   added: (robotat auv aa)
   goals met: 2 of 2
